# Modern Brewfile - Optimized for Web Development
# Organized by category for better maintainability

# Homebrew Taps
tap "fsouza/prettierd"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "ngrok/ngrok"

# =============================================================================
# CORE SYSTEM TOOLS
# =============================================================================

# Essential CLI tools
brew "git"
brew "curl"
brew "wget"
brew "jq"
brew "htop"
brew "tldr"

# Modern command line tools (replacements for traditional tools)
brew "bat"          # Better cat
brew "eza"          # Modern ls replacement (instead of exa)
brew "fd"           # Better find
brew "ripgrep"      # Better grep
brew "fzf"          # Fuzzy finder
brew "zoxide"       # Smart cd command
brew "stow"         # Symlink management
brew "tree"         # Directory visualization

# =============================================================================
# TERMINAL & SHELL
# =============================================================================

brew "tmux"
brew "gitmux"
brew "starship"     # Fast shell prompt
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-history-substring-search"
brew "atuin"        # Better shell history with sync
brew "direnv"       # Directory-specific environments

# =============================================================================
# DEVELOPMENT TOOLS
# =============================================================================

# Text Editor
brew "neovim"
brew "lua-language-server"

# Version Managers
brew "asdf"         # Unified version manager for multiple languages
# Individual version managers (alternative to asdf)
# brew "fnm"          # Fast Node Manager (better than nvm)
# brew "pyenv"        # Python version management
# brew "rbenv"        # Ruby version management

# Databases (using Docker instead)

# Build Tools
brew "watchman"     # File watching

# Code Quality & Formatting
brew "fsouza/prettierd/prettierd"

# Git Tools
brew "gh"           # GitHub CLI
brew "lazygit"      # Git TUI
brew "delta"        # Better git diffs

# Development Utilities
brew "ast-grep"     # Semantic code search
brew "imagemagick"  # Image processing

# =============================================================================
# WEB DEVELOPMENT SPECIFIC
# =============================================================================

# Package Managers & Runtimes
brew "pnpm"         # Fast package manager
brew "bun"          # Modern JavaScript runtime

# API Testing
brew "httpie"       # Better HTTP client

# Currently commented out - uncomment if needed
# brew "php"

# =============================================================================
# MACOS TOOLS
# =============================================================================

# Window Management
cask "nikitabobko/tap/aerospace"

# Keyboard Customization
cask "karabiner-elements"

# =============================================================================
# GUI APPLICATIONS
# =============================================================================

# Terminal
cask "ghostty"

# Development Tools
cask "docker"
cask "visual-studio-code"

# Development Mobile
cask "react-native-debugger"

# Browsers
cask "google-chrome"
cask "firefox"

# Design Tools
cask "figma"

# Music & Entertainment
cask "spotify"

# Fonts
cask "font-hack-nerd-font"
cask "font-fira-code-nerd-font"

# Productivity
cask "notion"
cask "obsidian"
cask "discord"
cask "raycast"

# Utilities
cask "ngrok"

# =============================================================================
# VS CODE EXTENSIONS (Essential Only)
# =============================================================================

# Core Extensions
vscode "GitHub.copilot"
vscode "GitHub.copilot-labs"
vscode "esbenp.prettier-vscode"
vscode "dbaeumer.vscode-eslint"

# React/TypeScript Development
vscode "bradlc.vscode-tailwindcss"
vscode "dsznajder.es7-react-js-snippets"

# Theme & Icons
vscode "Catppuccin.catppuccin-vsc"
vscode "Catppuccin.catppuccin-vsc-icons"

# Git Integration
vscode "eamodio.gitlens"

# Utility Extensions
vscode "asvetliakov.vscode-neovim"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "formulahendry.auto-rename-tag"
