tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "ngrok/ngrok"
tap "romkatv/powerlevel10k"
brew "apr-util"
brew "python@3.10"
brew "autojump"
brew "python@3.11"
brew "awscli"
brew "bat"
brew "bluetoothconnector"
brew "libxrender"
brew "harfbuzz"
brew "openjdk"
brew "bundletool"
brew "circleci"
brew "openldap"
brew "curl"
brew "folly"
brew "edencommon"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "freetds"
brew "fzf"
brew "gh"
brew "git"
brew "openssl@3"
brew "git-crypt"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "htop"
brew "libpq"
brew "neovim"
brew "php"
brew "pyenv"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "stow"
brew "tldr"
brew "tmux"
brew "watchman"
brew "wget"
brew "xclip"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "romkatv/powerlevel10k/powerlevel10k"
cask "android-commandlinetools"
cask "android-studio"
cask "discord"
cask "docker"
cask "font-hack-nerd-font"
cask "ngrok"
cask "notion"
cask "popsql"
cask "postico"
cask "react-native-debugger"
cask "todoist"
cask "visual-studio-code"
cask "zulu11"
