tap "fsouza/prettierd"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "ngrok/ngrok"
tap "romkatv/powerlevel10k"
brew "apr-util"
brew "python@3.10"
brew "autojump"
brew "python@3.11"
brew "awscli"
brew "bat"
brew "bluetoothconnector"
brew "libxrender"
brew "harfbuzz"
brew "openjdk"
brew "bundletool"
brew "circleci"
brew "openldap"
brew "curl"
brew "folly"
brew "edencommon"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "freetds"
brew "fzf"
brew "gh"
brew "git"
brew "openssl@3"
brew "git-crypt"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "htop"
brew "jq"
brew "libpq"
brew "lua-language-server"
brew "neovim"
brew "php"
brew "pyenv"
brew "rbenv"
brew "redis"
brew "ripgrep"
brew "starship"
brew "stow"
brew "tldr"
brew "tmux"
brew "watchman"
brew "wget"
brew "xclip"
brew "fsouza/prettierd/prettierd"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "romkatv/powerlevel10k/powerlevel10k"
cask "android-commandlinetools"
cask "android-studio"
cask "discord"
cask "docker"
cask "font-hack-nerd-font"
cask "kitty"
cask "ngrok"
cask "notion"
cask "popsql"
cask "postico"
cask "react-native-debugger"
cask "todoist"
cask "visual-studio-code"
cask "zulu11"
vscode "aaron-bond.better-comments"
vscode "asvetliakov.vscode-neovim"
vscode "atlassian.atlascode"
vscode "bierner.color-info"
vscode "bradlc.vscode-tailwindcss"
vscode "Catppuccin.catppuccin-vsc"
vscode "Catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "codezombiech.gitignore"
vscode "dbaeumer.vscode-eslint"
vscode "devadvice.serverlessconsole"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "GitHub.copilot"
vscode "GitHub.copilot-labs"
vscode "GitHub.github-vscode-theme"
vscode "GrapeCity.gc-excelviewer"
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
vscode "Gruntfuggly.todo-tree"
vscode "IBM.output-colorizer"
vscode "jasonnutter.search-node-modules"
vscode "mechatroner.rainbow-csv"
vscode "mikestead.dotenv"
vscode "mintlify.document"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vsliveshare.vsliveshare"
vscode "PKief.material-icon-theme"
vscode "RamiroBerrelleza.bitbucket-pull-requests"
vscode "redhat.vscode-yaml"
vscode "sdras.night-owl"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "xabikos.JavaScriptSnippets"
vscode "xyz.plsql-language"
vscode "zhuangtongfa.material-theme"
vscode "Zignd.html-css-class-completion"
